# PointElementHostedOnFaceUParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PointElementHostedOnFaceUParam Property
ParameterTypeId Class See Also
---
"Hosted U Parameter"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PointElementHostedOnFaceUParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PointElementHostedOnFaceUParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PointElementHostedOnFaceUParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace